<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"stacks/sample_bucket","backend":"fe3af9354f7ceff8658a46ba4e5380a35cdbd9389074b2926f68eaf968248849","plan_job_ref":"Job Terraform #10 at https://github.com/o11y-top/aws-terraform-multiple-environments/actions/runs/5369870473","plan_hash":"435d603f4d5cc803341d145efbe45e2846e8db05fcbd5be942bfdfd2604ca6f2","plan_text_format":"text","version":"1.35.0"} -->
Terraform plan for __stacks/sample_bucket__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sample_bucket.aws_s3_bucket.sample will be created
  + resource "aws_s3_bucket" "sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "sample"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "sample-bucket"
        }
      + tags_all                    = {
          + "Name"      = "sample-bucket"
          + "Stack"     = "sample_bucket"
          + "Terraform" = "default"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_bucket.aws_s3_bucket_versioning.sample will be created
  + resource "aws_s3_bucket_versioning" "sample" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_bucket_id = (known after apply)
```
</details>

:memo: Plan generated in [Terraform #10](https://github.com/o11y-top/aws-terraform-multiple-environments/actions/runs/5369870473)